'use client'

import ReactECharts from 'echarts-for-react'

const option = {
  title: {
    text: '中国人口变化/万',
  },
  legend: {},
  tooltip: {},
  dataset: {
    source: [
      ['product', '减少人口', '新增人口'],
      ['2000 年', 811, 1771],
      ['2001 年', 814, 1702],
      ['2002 年', 818, 1647],
      ['2003 年', 822, 1599],
      ['2004 年', 829, 1593],
      ['2005 年', 846, 1617],
      ['2006 年', 890, 1584],
      ['2007 年', 910, 1594],
      ['2008 年', 932, 1608],
      ['2009 年', 940, 1615],
      ['2010 年', 948, 1588],
      ['2011 年', 960, 1604],
      ['2012 年', 966, 1635],
      ['2013 年', 972, 1640],
      ['2014 年', 977, 1687],
      ['2015 年', 975, 1655],
      ['2016 年', 977, 1786],
      ['2017 年', 986, 1723],
      ['2018 年', 993, 1523],
      ['2019 年', 998, 1465],
      ['2020 年', 997, 1202],
      ['2021 年', 1014, 1062],
      ['2022 年', 1041, 956],
      ['2023 年', 1110, 902],
    ],
  },
  xAxis: { type: 'category' },
  yAxis: { type: 'value' },
  series: [{ type: 'bar' }, { type: 'bar' }],
}

export default function Home() {
  return (
    <div className="p-4 border">
      <ReactECharts option={option} />
    </div>
  )
}
